{"backend": "tensorflow", "keras_version": "2.2.0", "config": [{"config": {"name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 128, 128, 3], "activity_regularizer": null, "filters": 5, "padding": "valid", "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [4, 4], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 63, 63, 3], "activity_regularizer": null, "filters": 10, "padding": "valid", "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 30, 30, 3], "activity_regularizer": null, "filters": 50, "padding": "valid", "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_4", "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 14, 14, 3], "activity_regularizer": null, "filters": 100, "padding": "valid", "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1000, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 40, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}